Documents/НачалоТермообработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>НачалоТермообработки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МинДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодПрограммыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗагрузка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаКамеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогПоВидамРам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРамы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоРам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НачалоТермообработки/Forms/ФормаДокументаУФ/Ext/Form/Module.bsl
// Модуль формы документа НачалоТермообработки

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = Объект.Дата;
КонецПроцедуры // ПриСозданииНаСервере // + claude

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = Дата;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименованиеПрограммы()
	Если ЗначениеЗаполнено(Объект.ПодПрограмма) Тогда
		Программа = Объект.ПодПрограмма.Программа;
		Если ЗначениеЗаполнено(Программа) Тогда
			Элементы.НаименованиеПрограммы.Заголовок = "Программа: " + Строка(Программа);
		Иначе
			Элементы.НаименованиеПрограммы.Заголовок = "";
		КонецЕсли;
	Иначе
		Элементы.НаименованиеПрограммы.Заголовок = "";
	КонецЕсли;
КонецПроцедуры // ОбновитьНаименованиеПрограммы // + claude

&НаКлиенте
Процедура ПодПрограммаПриИзменении(Элемент)
	ПодПрограммаПриИзменении_НаСервере();
КонецПроцедуры // ПодПрограммаПриИзменении // + claude

&НаСервере
Процедура ПодПрограммаПриИзменении_НаСервере()
	ОбновитьНаименованиеПрограммы();
КонецПроцедуры // ПодПрограммаПриИзменении_НаСервере // + claude

&НаКлиенте
Процедура НачалоЧасыПриИзменении(Элемент)
	Если Объект.НачалоЧасы > 23 Тогда
		Объект.НачалоЧасы = 23;
	КонецЕсли;
КонецПроцедуры // НачалоЧасыПриИзменении // + claude

&НаКлиенте
Процедура НачалоМинутыПриИзменении(Элемент)
	Если Объект.НачалоМинуты > 59 Тогда
		Объект.НачалоМинуты = 59;
	КонецЕсли;
КонецПроцедуры // НачалоМинутыПриИзменении // + claude

&НаКлиенте
Процедура ТМЦКвоПриИзменении(Элемент)
	ТМЦКвоПриИзменении_НаСервере(Элементы.ТМЦ.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры // ТМЦКвоПриИзменении // + claude

&НаСервере
Процедура ТМЦКвоПриИзменении_НаСервере(НомерСтроки)
	Строка = Объект.ТМЦ.НайтиПоИдентификатору(НомерСтроки);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Как в 1С77 (ИзмКво): КвоРам дробное, без округления вверх // + claude
	КвоПродукцииНаРаме = Строка.ТМЦ.КвоПродукцииНаРаме;
	Если КвоПродукцииНаРаме > 0 Тогда
		Строка.КвоРам = Строка.Кво / КвоПродукцииНаРаме;
	Иначе
		Сообщить("У номенклатуры " + Строка.ТМЦ + " не заполнено количество продукции на раме!");
	КонецЕсли;

КонецПроцедуры // ТМЦКвоПриИзменении_НаСервере // + claude

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Первая запись - время документа из НачалоЧасы:НачалоМинуты, как УстановитьВремя в 1С77 // + claude
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ТекущийОбъект.Дата = НачалоДня(ТекущийОбъект.Дата)
			+ ТекущийОбъект.НачалоЧасы * 3600 + ТекущийОбъект.НачалоМинуты * 60;
	КонецЕсли; // первая запись

	// Формируем ИтогПоВидамРам: группировка ТЧ по ВидРамы + сумма КвоРам,
	// формат Ч12.2 с завершающей запятой - как в 1С77 и в журнале НачалоТермообработки // + claude
	ТЗ = ТекущийОбъект.ТМЦ.Выгрузить();
	ТЗ.Свернуть("ВидРамы", "КвоРам");
	ТекстИтог = "";
	Для Каждого Строка Из ТЗ Цикл
		ТекстИтог = СокрЛП(ТекстИтог) + Лев(СокрЛП(Строка(Строка.ВидРамы)), 1) + СокрЛП(Формат(Строка.КвоРам, "Ч12.2")) + ",";
	КонецЦикла;
	ТекущийОбъект.ИтогПоВидамРам = ТекстИтог;
КонецПроцедуры // ПередЗаписьюНаСервере // + claude
